#+SETUPFILE: .orgconfig
#+NAME: setup
#+BEGIN_SRC emacs-lisp :results silent
  (require 'epkg)

  (defun emir--format-license-table (table)
    (--when-let (assq nil table)
      (setcar it "((unknown))"))
    (--when-let (assoc "pending" table)
      (setcar it  "((pending))"))
    (--when-let (assoc "failure" table)
      (setcar it  "((failure))"))
    (--when-let (assoc "failure(p)" table)
      (setcar it  "((failure/p))"))
    (--when-let (assoc "none" table)
      (setcar it  "((none))"))
    (let ((total (apply '+ (mapcar 'cadr table)))
          (gnu   (apply '+ (mapcar (pcase-lambda (`(,license ,count))
                                     (if (string-match-p "GPL" license) count 0))
                                   table))))
        (cl-flet ((percent (n) (round (* (/ n total 1.0) 100))))
          `(("License" "Count" "Percent")
            hline ,@(mapcar (pcase-lambda (`(,license ,count))
                              (list license count (percent count)))
                            table)
            hline ("total GNU" ,gnu ,(percent gnu))
            hline ("total" ,total 100)))))

  (defun emir--insert-melpa-packages-using-licenses (&rest licenses)
    (epkg-with-org-header ("Package" "License" "Class" "Link")
      (epkg-sql [:select :distinct
                 [packages:name packages:license packages:class packages:repopage]
                 :from [packages melpa-recipes]
                 :where (= packages:name melpa-recipes:epkg-package)
                 :and license :in $v1
                 :group-by packages:repopage
                 :order-by [(asc packages:name)]]
                (apply #'vector licenses))))

  (defun emir--insert-mirror-packages-using-licenses (&rest licenses)
    (epkg-with-org-header ("Package" "License" "Class" "M" "Link")
      (mapcar (pcase-lambda (`(,name ,license ,class ,repopage))
                (list name license class
                      (if (melpa-get name) t "")
                      (and (not (eq class 'wiki)) repopage)))
              (epkg-sql [:select [name license class repopage] :from packages
                         :where license :in $v1
                         :and (not (= class 'shelved))
                         :order-by [(asc name)]]
                        (apply #'vector licenses)
                        [shelved]))))
#+END_SRC
[[https://emacsmirror.net/stats][up]]

* Licenses used by packages on Melpa
** Overview
#+BEGIN_SRC emacs-lisp
  (emir--format-license-table
   (epkg-sql [:select :distinct [packages:license (funcall count *)] :as count
              :from [packages melpa-recipes]
              :where (= packages:name melpa-recipes:epkg-package)
              :group-by packages:license
              :order-by [(desc count) (asc license)]]))
#+END_SRC
#+RESULTS:
| License       | Count | Percent |
|---------------+-------+---------|
| GPL-3+        |  2511 |      68 |
| GPL-2+        |   514 |      14 |
| GPL-3         |   136 |       4 |
| MIT (x11)     |   132 |       4 |
| MIT           |   128 |       3 |
| BSD-2-clause  |    70 |       2 |
| BSD-3-clause  |    38 |       1 |
| Apache-2.0    |    35 |       1 |
| unlicense     |    32 |       1 |
| public-domain |    26 |       1 |
| as-is         |    22 |       1 |
| WTFPL         |    13 |       0 |
| ((failure/p)) |    10 |       0 |
| GPL-1+        |     4 |       0 |
| WTFPL-2       |     4 |       0 |
| ((failure))   |     4 |       0 |
| AGPL-3+       |     3 |       0 |
| Artistic-2.0  |     3 |       0 |
| BEER-WARE     |     3 |       0 |
| ISC (and)     |     3 |       0 |
| LGPL-3+       |     3 |       0 |
| CeCILL-B      |     2 |       0 |
| ISC (and/or)  |     2 |       0 |
| LGPL          |     2 |       0 |
| LGPL-2.1      |     2 |       0 |
| LGPL-3        |     2 |       0 |
| CC0 1.0       |     1 |       0 |
| COPYLOVE      |     1 |       0 |
| LGPL-3.0      |     1 |       0 |
| MPL-2         |     1 |       0 |
| zlib License  |     1 |       0 |
|---------------+-------+---------|
| total GNU     |  3178 |      86 |
|---------------+-------+---------|
| total         |  3709 |     100 |

** Removed packages
#+BEGIN_SRC emacs-lisp
  (let ((removed
         '(;; [[orgit-rev:~/git/emacs/melpa/::7aa634e8]]
           "smali-mode"
           ;; [[orgit-rev:~/git/emacs/melpa/::cf92ce1a]]
           "achievements"
           "avk-emacs-themes"
           "bpr"
           "coq-commenter"
           "crab"
           "darkane-theme"
           "easy-after-load"
           "edit-at-point"
           "el-pocket"
           "eno"
           "ess-R-object-popup"
           "euslisp-mode"
           "firebelly-theme"
           "flappymacs"
           "flycheck-scala-sbt"
           "gap-mode"
           "ghost-blog"
           "hlint-refactor"
           "ids-edit"
           "imgix"
           "inf-php"
           "inform7-mode"
           "ivariants"
           "ivs-edit"
           "jaunte"
           "mandoku-tls"
           "memento"
           "monochrome-theme"
           "n3-mode"
           "niflheim-theme"
           "nnir-est"
           "nyan-prompt"
           "org-jekyll"
           "ox-pandoc"
           "psc-ide"
           "sicp"
           "yatex"
           "zerodark-theme"
           ;; [[orgit-rev:~/git/emacs/melpa/::c3366117]]
           "crontab-mode"
           "harvest"
           "helm-ctest"
           "inline-crypt"
           "plantuml-mode"
           "pushover"
           "py-gnitset"
           "pyim-greatdict"
           "railgun"
           "rails-new"
           "refheap"
           "ruby-dev"
           "ruby-guard"
           "sly-repl-ansi-color"
           "smartwin"
           "sourcetalk"
           "stgit"
           "subshell-proc"
           "sudden-death"
           "syslog-mode"
           "tj-mode"
           "tronesque-theme"
           "turkish"
           "uzumaki"
           "vimgolf"
           "wordsmith-mode"
           "xah-css-mode"
           "xah-elisp-mode"
           "xah-find"
           "xah-fly-keys"
           "xah-get-thing"
           "xah-lookup"
           "xah-math-input"
           "xah-reformat-code"
           "xah-replace-pairs"
           "xahk-mode"
           "zig-mode"
           ;; [[orgit-log:~/git/emacs/melpa/::master]]
           "slime-ritz"
           ;; [[orgit-rev:~/git/emacs/melpa/::b20f5126]]
           "lively"
           ;; [[orgit-rev:~/git/emacs/melpa/::e5476274]]
           "slime-annot"
           )))
    (epkg-with-org-header ("Package" "R" "License" "Class" "Link")
      (--keep (-when-let (pkg (epkg it))
                (list it
                      (if (melpa-get it) "t" "")
                      (oref pkg license)
                      (substring (symbol-name (class-of pkg)) 5 -8)
                      (oref pkg repopage)))
              removed)))
#+END_SRC
#+RESULTS:
| Package (74)        | R | License         | Class     | Link                                                    |
|---------------------+---+-----------------+-----------+---------------------------------------------------------|
| achievements        | t | MIT             | bitbucket | https://bitbucket.org/gvol/emacs-achievements           |
| avk-emacs-themes    | t | GPL-3+          | github    | https://github.com/avkoval/avk-emacs-themes             |
| bpr                 | t | unlicense       | github    | https://github.com/ilya-babanov/emacs-bpr               |
| coq-commenter       | t | GPL-3+          | github    | https://github.com/ailrun/coq-commenter                 |
| crab                |   | pending         | shelved   | https://github.com/puffnfresh/crab-emacs                |
| easy-after-load     | t | GPL-3+          | github    | https://github.com/pd/easy-after-load                   |
| edit-at-point       | t | failure(p)      | github    | https://github.com/enoson/edit-at-point.el              |
| el-pocket           | t | GPL-3+          | github    | https://github.com/pterygota/el-pocket                  |
| eno                 | t | failure(p)      | github    | https://github.com/enoson/eno.el                        |
| ess-R-object-popup  |   | pending         | shelved   | https://github.com/myuhe/ess-R-object-popup.el          |
| euslisp-mode        | t | GPL-3+          | github    | https://github.com/iory/euslisp-mode                    |
| flappymacs          | t | MIT (x11)       | github    | https://github.com/taksatou/flappymacs                  |
| flycheck-scala-sbt  |   | failure         | shelved   | https://github.com/rjmac/flycheck-scala-sbt             |
| gap-mode            | t | MIT             | bitbucket | https://bitbucket.org/gvol/gap-mode                     |
| ghost-blog          | t | GPL-3+          | github    | https://github.com/javaguirre/ghost-blog-emacs          |
| hlint-refactor      | t | MIT (x11)       | github    | https://github.com/mpickering/hlint-refactor-mode       |
| ids-edit            | t | GPL-3+          | github    | https://github.com/kawabata/ids-edit                    |
| imgix               |   | pending         | shelved   | https://github.com/imgix/imgix-emacs                    |
| inf-php             |   | pending         | shelved   | https://github.com/taksatou/inf-php                     |
| inform7-mode        |   | pending         | shelved   | https://github.com/fred-o/inform7-mode                  |
| ivariants           | t | GPL-3+          | github    | https://github.com/kawabata/emacs-ivariants             |
| ivs-edit            | t | GPL-3+          | github    | https://github.com/kawabata/ivs-edit                    |
| jaunte              |   | pending         | shelved   | https://github.com/kawaguchi/jaunte.el                  |
| mandoku-tls         | t | GPL-3+          | github    | https://github.com/mandoku/mandoku-tls                  |
| memento             |   | pending         | shelved   | https://github.com/ehartc/memento                       |
| monochrome-theme    | t | MIT             | github    | https://github.com/fxn/monochrome-theme.el              |
| n3-mode             |   | pending         | shelved   | https://github.com/doriantaylor/n3-mode-for-emacs       |
| nnir-est            | t | GPL-3+          | github    | https://github.com/kawabata/nnir-est                    |
| nyan-prompt         |   | COPYLOVE        | github    | https://github.com/PuercoPop/nyan-prompt                |
| org-jekyll          |   | pending         | shelved   | https://github.com/juanre/org-jekyll                    |
| ox-pandoc           | t | GPL-3+          | github    | https://github.com/kawabata/ox-pandoc                   |
| psc-ide             | t | GPL-3+          | github    | https://github.com/epost/psc-ide-emacs                  |
| sicp                | t | GPL-3+          | github    | https://github.com/webframp/sicp-info                   |
| yatex               | t | BSD-2-clause    | hg        |                                                         |
| zerodark-theme      | t | GPL-3+          | github    | https://github.com/NicolasPetton/zerodark-theme         |
| crontab-mode        |   | GPL-2           | shelved   | https://github.com/emacsorphanage/crontab-mode          |
| harvest             | t | GPL-3+          | github    | https://github.com/kostajh/harvest.el                   |
| helm-ctest          | t | GPL-3+          | github    | https://github.com/danlamanna/helm-ctest                |
| inline-crypt        | t | GPL-2+          | github    | https://github.com/Sodel-the-Vociferous/inline-crypt-el |
| plantuml-mode       | t | GPL-3+          | github    | https://github.com/skuro/plantuml-mode                  |
| pushover            | t | GPL-3+          | git       |                                                         |
| py-gnitset          | t | GPL-3+          | github    | https://github.com/quodlibetor/py-gnitset               |
| pyim-greatdict      |   | pending         | shelved   | https://github.com/tumashu/pyim-greatdict               |
| railgun             |   | pending         | shelved   | https://github.com/mbriggs/railgun.el                   |
| rails-new           |   | pending         | shelved   | https://github.com/cheunghy/rails-new                   |
| refheap             |   | none            | shelved   | https://github.com/Raynes/refheap.el                    |
| ruby-dev            |   | pending         | shelved   | https://github.com/Mon-Ouie/ruby-dev.el                 |
| ruby-guard          |   | pending         | shelved   | https://github.com/cheunghy/ruby-guard                  |
| sly-repl-ansi-color |   | GPL-2+          | github    | https://github.com/PuercoPop/sly-repl-ansi-color        |
| smartwin            |   | GPL-2           | github    | https://github.com/jerryxgh/smartwin                    |
| sourcetalk          |   | pending         | shelved   | https://github.com/malroc/sourcetalk_emacs              |
| stgit               |   | GPL-2+          | github    | https://github.com/ctmarinas/stgit                      |
| subshell-proc       |   | pending         | shelved   | https://github.com/andrewmains12/subshell-proc          |
| sudden-death        |   | pending         | shelved   | https://github.com/yewton/sudden-death.el               |
| syslog-mode         |   | GPL-2           | github    | https://github.com/vapniks/syslog-mode                  |
| tj-mode             |   | pending         | shelved   | https://github.com/katspaugh/tj-mode                    |
| turkish             | t | MIT             | github    | https://github.com/emres/turkish-mode                   |
| uzumaki             |   | pending         | shelved   | https://github.com/geyslan/uzumaki                      |
| vimgolf             |   | CC BY-NC-SA 3.0 | github    | https://github.com/timvisher/vimgolf.el                 |
| wordsmith-mode      | t | GPL-3+          | github    | https://github.com/istib/wordsmith-mode                 |
| xah-css-mode        | t | GPL-3           | github    | https://github.com/xahlee/xah-css-mode                  |
| xah-elisp-mode      | t | GPL-3           | github    | https://github.com/xahlee/xah-elisp-mode                |
| xah-find            | t | GPL-3           | github    | https://github.com/xahlee/xah-find                      |
| xah-fly-keys        | t | GPL-3           | github    | https://github.com/xahlee/xah-fly-keys                  |
| xah-get-thing       | t | GPL-3           | github    | https://github.com/xahlee/xah-get-thing-or-selection    |
| xah-lookup          | t | GPL-3           | github    | https://github.com/xahlee/lookup-word-on-internet       |
| xah-math-input      | t | GPL-3           | github    | https://github.com/xahlee/xah-math-input                |
| xah-reformat-code   | t | GPL-3           | github    | https://github.com/xahlee/xah-reformat-code             |
| xah-replace-pairs   | t | GPL-3           | github    | https://github.com/xahlee/xah-replace-pairs             |
| xahk-mode           | t | GPL-3           | github    | https://github.com/xahlee/xahk-mode.el                  |
| zig-mode            | t | GPL-3+          | github    | https://github.com/AndreaOrru/zig-mode                  |
| slime-ritz          |   | EPL             | shelved   |                                                         |
| lively              | t | GPL-3+          | github    | https://github.com/purcell/lively                       |
| slime-annot         |   | none            | shelved   |                                                         |

** No license specified
#+BEGIN_SRC emacs-lisp
  (emir--insert-melpa-packages-using-licenses "pending")
#+END_SRC
#+RESULTS:

** Failure to extract license
#+BEGIN_SRC emacs-lisp
  (emir--insert-melpa-packages-using-licenses "failure")
#+END_SRC
#+RESULTS:
| Package (3)     | License | Class    | Link                                              |
|-----------------+---------+----------+---------------------------------------------------|
| clang-format    | failure | orphaned | https://github.com/emacsorphanage/clang-format    |
| redshank        | failure | shelved  |                                                   |
| ruby-additional | failure | orphaned | https://github.com/emacsorphanage/ruby-additional |

** Problematic licenses
#+BEGIN_SRC emacs-lisp
  (emir--insert-melpa-packages-using-licenses "GPL" "GPL-2")
#+END_SRC
#+RESULTS:

* Licenses used by packages on the Emacsmirror
** Overview
#+BEGIN_SRC emacs-lisp
  (emir--format-license-table
   (epkg-sql [:select [license (funcall count *)] :as count
              :from packages
              :where (and (not (= class 'builtin))
                          (not (= class 'shelved)))
              :group-by license
              :order-by [(desc count) (asc license)]]))
#+END_SRC
#+RESULTS:
| License         | Count | Percent |
|-----------------+-------+---------|
| GPL-3+          |  3146 |      60 |
| GPL-2+          |  1334 |      25 |
| GPL-3           |   144 |       3 |
| MIT (x11)       |   131 |       2 |
| MIT             |   131 |       2 |
| BSD-2-clause    |    74 |       1 |
| public-domain   |    49 |       1 |
| BSD-3-clause    |    42 |       1 |
| unlicense       |    34 |       1 |
| Apache-2.0      |    33 |       1 |
| WTFPL           |    32 |       1 |
| as-is           |    29 |       1 |
| ((failure/p))   |    12 |       0 |
| GPL-1+          |     6 |       0 |
| WTFPL-2         |     5 |       0 |
| LGPL-3+         |     4 |       0 |
| AGPL-3+         |     3 |       0 |
| Artistic-2.0    |     3 |       0 |
| GPL-2           |     3 |       0 |
| ISC (and)       |     3 |       0 |
| MS-PL           |     3 |       0 |
| COPYLOVE        |     2 |       0 |
| CeCILL-B        |     2 |       0 |
| ISC (and/or)    |     2 |       0 |
| LGPL-2.1        |     2 |       0 |
| LGPL-3          |     2 |       0 |
| ((failure))     |     2 |       0 |
| BEER-WARE       |     1 |       0 |
| CC BY-NC-SA 3.0 |     1 |       0 |
| CC0 1.0         |     1 |       0 |
| GPL             |     1 |       0 |
| LGPL            |     1 |       0 |
| LGPL-3.0        |     1 |       0 |
| MPL-2           |     1 |       0 |
| Ruby            |     1 |       0 |
| ((pending))     |     1 |       0 |
| zlib License    |     1 |       0 |
|-----------------+-------+---------|
| total GNU       |  4647 |      89 |
|-----------------+-------+---------|
| total           |  5243 |     100 |

** No license specified
#+BEGIN_SRC emacs-lisp
  (emir--insert-mirror-packages-using-licenses "pending")
#+END_SRC
#+RESULTS:
| Package (1) | License | Class | M | Link                                                                       |
|-------------+---------+-------+---+----------------------------------------------------------------------------|
| ada-ref-man | pending | elpa  |   | https://git.savannah.gnu.org/cgit/emacs/elpa.git/tree/packages/ada-ref-man |

** Unknown license
#+BEGIN_SRC emacs-lisp
  (epkg-with-org-header ("Package" "Class" "License")
    (epkg-sql [:select [name class license] :from packages
               :where (isnull license)
               :and :not packages:class :in $v1
               :order-by [(asc name)]]
              [shelved])))
#+END_SRC
#+RESULTS:

** Failure to extract license
#+BEGIN_SRC emacs-lisp
  (emir--insert-mirror-packages-using-licenses "failure" "failure(p)")
#+END_SRC
#+RESULTS:
| Package (14)          | License    | Class    | M | Link                                                                           |
|-----------------------+------------+----------+---+--------------------------------------------------------------------------------|
| clang-format          | failure    | orphaned | t | https://github.com/emacsorphanage/clang-format                                 |
| cython-mode           | failure(p) | minority | t |                                                                                |
| edit-at-point         | failure(p) | github   | t | https://github.com/enoson/edit-at-point.el                                     |
| emacs-setup           | failure(p) | github   | t | https://github.com/echosa/emacs-setup                                          |
| eno                   | failure(p) | github   | t | https://github.com/enoson/eno.el                                               |
| glsl-mode             | failure(p) | github   | t | https://github.com/jimhourihan/glsl-mode                                       |
| golint                | failure(p) | subtree  | t |                                                                                |
| manued                | failure(p) | github   |   | https://github.com/yamauchih/manued                                            |
| nm                    | failure(p) | github   | t | https://github.com/tjim/nevermore                                              |
| omtose-phellack-theme | failure(p) | github   | t | https://github.com/franksn/omtose-phellack-theme                               |
| ruby-additional       | failure    | orphaned | t | https://github.com/emacsorphanage/ruby-additional                              |
| trr                   | failure(p) | github   | t | https://github.com/kawabata/emacs-trr                                          |
| tumblesocks           | failure(p) | github   | t | https://github.com/gcr/tumblesocks                                             |
| uni-confusables       | failure(p) | elpa     |   | https://git.savannah.gnu.org/cgit/emacs/elpa.git/tree/packages/uni-confusables |

[[mu4e:msgid:87ing5dw09.fsf@bernoul.li][Organizing the quest]]

- clang-format: BSD-3-clause (huge effort)
- glsl-mode [[https://github.com/jimhourihan/glsl-mode/issues/8][#8]] "No version means any version"
- ruby-additional: ruby (huge effort)

** Problematic licenses
#+BEGIN_SRC emacs-lisp
  (emir--insert-mirror-packages-using-licenses "GPL" "GPL-2")
#+END_SRC
#+RESULTS:
| Package (4)    | License | Class  | M | Link                                       |
|----------------+---------+--------+---+--------------------------------------------|
| coq            | GPL     | github |   | https://github.com/ProofGeneral/PG         |
| gnus-autocheck | GPL-2   | github |   | https://github.com/slaanesh/gnus-autocheck |
| smartwin       | GPL-2   | github |   | https://github.com/jerryxgh/smartwin       |
| syslog-mode    | GPL-2   | github |   | https://github.com/vapniks/syslog-mode     |

Pending:
- coq [[https://github.com/ProofGeneral/PG/issues/198][#198]]
- gnus-autocheck [[https://github.com/slaanesh/gnus-autocheck/issues/2][#2]]
- smartwin [[https://github.com/jerryxgh/smartwin/issues/3][#3]]
- syslog-mode [[https://github.com/vapniks/syslog-mode/issues/15][#15]]

